; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-5-3-2-8-8-5) (:domain depots)
(:objects
	depot0 depot1 depot2 depot3 depot4 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 - Pallet
	crate0 crate1 crate2 crate3 crate4 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear crate3)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 depot3)
	(clear crate1)
	(at pallet4 depot4)
	(clear pallet4)
	(at pallet5 distributor0)
	(clear pallet5)
	(at pallet6 distributor1)
	(clear pallet6)
	(at pallet7 distributor2)
	(clear crate4)
	(at truck0 depot0)
	(at truck1 depot3)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 depot3)
	(available hoist3)
	(at hoist4 depot4)
	(available hoist4)
	(at hoist5 distributor0)
	(available hoist5)
	(at hoist6 distributor1)
	(available hoist6)
	(at hoist7 distributor2)
	(available hoist7)
	(at crate0 distributor2)
	(on crate0 pallet7)
	(at crate1 depot3)
	(on crate1 pallet3)
	(at crate2 depot1)
	(on crate2 pallet1)
	(at crate3 depot1)
	(on crate3 crate2)
	(at crate4 distributor2)
	(on crate4 crate0)
)

(:goal (and
		(on crate0 pallet2)
		(on crate1 crate4)
		(on crate2 pallet5)
		(on crate3 pallet6)
		(on crate4 pallet4)
	)
))

; plan
1. (lift hoist3 crate1 pallet3 depot3)
   deleted: (at crate1 depot3) (available hoist3) (on crate1 pallet3) (clear crate1)
   added: (lifting hoist3 crate1) (clear pallet3)
   goals met: 0 of 5
2. (load hoist3 crate1 truck1 depot3)
   deleted: (lifting hoist3 crate1)
   added: (in crate1 truck1) (available hoist3)
   goals met: 0 of 5
3. (lift hoist7 crate4 crate0 distributor2)
   deleted: (at crate4 distributor2) (available hoist7) (on crate4 crate0) (clear crate4)
   added: (lifting hoist7 crate4) (clear crate0)
   goals met: 0 of 5
4. (drive truck1 depot3 distributor2)
   deleted: (at truck1 depot3)
   added: (at truck1 distributor2)
   goals met: 0 of 5
5. (load hoist7 crate4 truck1 distributor2)
   deleted: (lifting hoist7 crate4)
   added: (in crate4 truck1) (available hoist7)
   goals met: 0 of 5
6. (lift hoist7 crate0 pallet7 distributor2)
   deleted: (at crate0 distributor2) (available hoist7) (on crate0 pallet7) (clear crate0)
   added: (lifting hoist7 crate0) (clear pallet7)
   goals met: 0 of 5
7. (load hoist7 crate0 truck1 distributor2)
   deleted: (lifting hoist7 crate0)
   added: (in crate0 truck1) (available hoist7)
   goals met: 0 of 5
8. (drive truck1 distributor2 depot4)
   deleted: (at truck1 distributor2)
   added: (at truck1 depot4)
   goals met: 0 of 5
9. (unload hoist4 crate4 truck1 depot4)
   deleted: (available hoist4) (in crate4 truck1)
   added: (lifting hoist4 crate4)
   goals met: 0 of 5
10. (drop hoist4 crate4 pallet4 depot4)
   deleted: (lifting hoist4 crate4) (clear pallet4)
   added: (at crate4 depot4) (available hoist4) (on crate4 pallet4) (clear crate4)
   goals met: 1 of 5
11. (unload hoist4 crate1 truck1 depot4)
   deleted: (available hoist4) (in crate1 truck1)
   added: (lifting hoist4 crate1)
   goals met: 1 of 5
12. (lift hoist1 crate3 crate2 depot1)
   deleted: (at crate3 depot1) (available hoist1) (on crate3 crate2) (clear crate3)
   added: (lifting hoist1 crate3) (clear crate2)
   goals met: 1 of 5
13. (drive truck0 depot0 depot1)
   deleted: (at truck0 depot0)
   added: (at truck0 depot1)
   goals met: 1 of 5
14. (load hoist1 crate3 truck0 depot1)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck0) (available hoist1)
   goals met: 1 of 5
15. (lift hoist1 crate2 pallet1 depot1)
   deleted: (at crate2 depot1) (available hoist1) (on crate2 pallet1) (clear crate2)
   added: (lifting hoist1 crate2) (clear pallet1)
   goals met: 1 of 5
16. (load hoist1 crate2 truck0 depot1)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck0) (available hoist1)
   goals met: 1 of 5
17. (drive truck0 depot1 distributor0)
   deleted: (at truck0 depot1)
   added: (at truck0 distributor0)
   goals met: 1 of 5
18. (drive truck1 depot4 depot2)
   deleted: (at truck1 depot4)
   added: (at truck1 depot2)
   goals met: 1 of 5
19. (drop hoist4 crate1 crate4 depot4)
   deleted: (lifting hoist4 crate1) (clear crate4)
   added: (at crate1 depot4) (available hoist4) (on crate1 crate4) (clear crate1)
   goals met: 2 of 5
20. (unload hoist2 crate0 truck1 depot2)
   deleted: (available hoist2) (in crate0 truck1)
   added: (lifting hoist2 crate0)
   goals met: 2 of 5
21. (drop hoist2 crate0 pallet2 depot2)
   deleted: (lifting hoist2 crate0) (clear pallet2)
   added: (at crate0 depot2) (available hoist2) (on crate0 pallet2) (clear crate0)
   goals met: 3 of 5
22. (unload hoist5 crate2 truck0 distributor0)
   deleted: (available hoist5) (in crate2 truck0)
   added: (lifting hoist5 crate2)
   goals met: 3 of 5
23. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 3 of 5
24. (drop hoist5 crate2 pallet5 distributor0)
   deleted: (lifting hoist5 crate2) (clear pallet5)
   added: (at crate2 distributor0) (available hoist5) (on crate2 pallet5) (clear crate2)
   goals met: 4 of 5
25. (unload hoist6 crate3 truck0 distributor1)
   deleted: (available hoist6) (in crate3 truck0)
   added: (lifting hoist6 crate3)
   goals met: 4 of 5
26. (drop hoist6 crate3 pallet6 distributor1)
   deleted: (lifting hoist6 crate3) (clear pallet6)
   added: (at crate3 distributor1) (available hoist6) (on crate3 pallet6) (clear crate3)
   goals met: 5 of 5
